# •	перейдите в каталог PZ11. Выведите список всех файлов в этом каталоге.
#     Имена вложенных подкаталогов выводить не нужно.
# •	перейти в корень проекта, создать папку с именем test. В ней создать еще одну
#     папку test1. В папку test переместить два файла из П36, а в папку test1 один файл из П37.
#     Файл из П37 переименовать в test.txt. Вывести в консоль информацию о размере файлов в папкe test.
# •	перейти в папку с ПЗ11, найти там файл с самым коротким именем, имя вывести в консоль.
#     Использовать функцию basename() os.path.basename()).
# •	перейти в любую папку где есть отчет в формате pdf и «запустить» файл в привязанной к нему
#     программе. Использовать функцию os.startfile().