# Дана строка. Вывести строку, содержащую те же
# символы, но расположенные в обратном порядке.
line = input('Введите строку: ')
print("Итоговая строка: ", line[::-1])