# Дана строка. Вывести строку, содержащую те же
# символы, но расположенные в обратном порядке
line = input('Введите строку: ')
reversed_line = line[::-1]
print(reversed_line)
