info_users = [
    (1942686, 'GHghj', 'ул.Строителей, д.10, г.Примерный, 124335', 2, 2986, 10029039, 81, '01.09.04'),
    (4647686, 'AWA', 'ул.Строителей, д.11, г.Примерный, 123975', 2, 2909, 10000909, 82, '02.09.04'),
    (1127686, 'FTT', 'ул.Строителей, д.12, г.Примерный, 123490', 1, 2903, 29030909, 83, '03.09.04'),
    (1917786, 'KOOK', 'ул.Строителей, д.13, г.Примерный, 123997', 9, 2943, 10002903, 84, '04.09.04'),
    (1078786, 'FFFT', 'ул.Строителей, д.14, г.Примерный, 123355', 6, 2212, 12903909, 85, '05.09.04'),
    (1909886, 'SSD', 'ул.Строителей, д.15, г.Примерный, 123442', 5, 8653, 10290309, 86, '06.09.04'),
    (1907680, 'XXR', 'ул.Строителей, д.16, г.Примерный, 123424', 2, 8982, 12903909, 87, '07.09.04'),
    (1797766, 'AWASD', 'ул.Строителей, д.17, г.Примерный, 123231', 8, 4357, 10029039, 88, '08.09.04'),
    (1907674, 'JGIY', 'ул.Строителей, д.18, г.Примерный, 123456', 5, 2888, 10002903, 89, '09.09.04'),
    (1907634, 'ERD', 'ул.Строителей, д.19, г.Примерный, 123978', 1, 1111, 29030909, 90, '10.09.04')
]
